G = {"Адмиралтейская" :{
        "Садовая":4},
     "Садовая" :
         [{"Сенная площадь":5},
          {"Спасская":4},
          {"Адмиралтейская":5},
          {"Звенигородская":5}],
     "Сенная площадь" :
         ["Садовая",
          "Спасская"],
     "Спасская" :
         ["Садовая",
          "Сенная площадь",
          "Достоевская"],
     "Звенигородская" :
         ["Пушкинская",
          "Садовая"],
     "Пушкинская" :
         ["Звенигородская",
          "Владимирская"],
     "Владимирская" :
         ["Достоевская",
          "Пушкинская"],
     "Достоевская" :
         ["Владимирская",
          "Спасская"]}